results/routeA/transient_cfd_scaling_pilot/plain_20261006_0710/rank_06/case/constant/momentumTransport
FoamFile
{
    format ascii;
    class dictionary;
    location "constant";
    object momentumTransport;
}
simulationType laminar;
