results/routeA/transient_cfd_scaling_pilot/plain_20261006_0710/rank_06/case/system/fvSolution
FoamFile
{ format ascii; class dictionary; object fvSolution; }
solvers
{
U
{
solver PBiCGStab;
preconditioner DILU;
tolerance 1e-12;
relTol 0;
maxIter 2000;
}
e
{
solver PBiCGStab;
preconditioner DILU;
tolerance 1e-12;
relTol 0;
maxIter 2000;
}
p_rgh
{
solver PCG;
preconditioner DIC;
tolerance 1e-12;
relTol 0;
maxIter 4000;
}
rho
{
solver diagonal;
tolerance 1e-14;
relTol 0;
maxIter 1;
}
UFinal
{
solver PBiCGStab;
preconditioner DILU;
tolerance 1e-12;
relTol 0;
maxIter 2000;
}
eFinal
{
solver PBiCGStab;
preconditioner DILU;
tolerance 1e-12;
relTol 0;
maxIter 2000;
}
p_rghFinal
{
solver PCG;
preconditioner DIC;
tolerance 1e-12;
relTol 0;
maxIter 4000;
}
rhoFinal
{
solver diagonal;
tolerance 1e-14;
relTol 0;
maxIter 1;
}
}
PIMPLE
{
momentumPredictor true;
simpleRho false;
transonic false;
consistent false;
hydrostaticInitialisation false;
correctPhi false;
nNonOrthogonalCorrectors 0;
transportPredictionFirst true;
transportCorrectionFinal true;
nOuterCorrectors 24;
nCorrectors 2;
pRefPoint (0.0496875 0.0496875 0.0005);
pRefValue 0;
}
relaxationFactors
{
fields
{

}
equations
{

}
}
